app/views/locations/shared/_search_tags.html.erb

SELECT "tags".* FROM "tags"
---
    <div class="col-8">
      <%= select_tag :tags,
          options_for_select(ActsAsTaggableOn::Tag.all.collect{ |tag| [tag.name] }, params[:tags]).html_safe,
          multiple: true,
          class: "select2"