app/views/account/users/_navigation.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 685]]
---
          <%= link_to account_reviews_path, class: "list-link" do  %>
            Reviews (<%= current_user.reviews.count %>)