app/controllers/application_controller.rb

  def set_counter
      @review_count = Review.count
---
SELECT COUNT(*) FROM "reviews"