app/controllers/locations_controller.rb

SELECT "tags".* FROM "tags"
SELECT "places".* FROM "places" WHERE (places.latitude IS NOT NULL AND places.longitude IS NOT NULL)
---
  def map
    # SEARCH
    if params[:query].present?
      @places = @location.places.search_by_name_address_description_tags(params[:query])
      if params[:tags].present?
        @places = @places.tagged_with(params[:tags])
      end
    elsif params[:tags].present?
      @places = @location.places.tagged_with(params[:tags])
    else
      # RETURNING ALL
      @places = Place.all
    end

    # MAPBOX
    if @places == []
      @markers = {}
    else
      @markers = @places.geocoded.map do |place|

SELECT "tags".* FROM "tags"
---
  def show
    @location = current_user.location
    @places = @location.places

    @activities = Place.tagged_with("Activity")
    # @location.places.where(category: "[\"Activity\"]")


    if params[:query].present?
      @places = @location.places.search_by_name_description_category(params[:query])
      if params[:tags].present?