app/controllers/places_controller.rb

  def index

    # SEARCH
    if params[:query].present?
      @places = Place.search_by_name_description_category(params[:query])
      if params[:tags].present?
---
SELECT "tags".* FROM "tags"