app/models/user.rb

  def default_location
    self.location ||= Location.first
---
SELECT "locations".* FROM "locations" ORDER BY "locations"."id" DESC LIMIT $1  [["LIMIT", 1]]