app/views/locations/map.html.erb


     <%= select_tag :tags,
     options_for_select(ActsAsTaggableOn::Tag.all.collect{ |tag| [tag.name] }, params[:tags]).html_safe,
     multiple: true,
     class: "select2 form-control flex-grow-1 mb-2"
---
SELECT "tags".* FROM "tags"